app/Controllers/AdminController.php

    public function employes(): string
    {
        $deptModel = new DepartementModel();
        $departements = $deptModel->orderBy('nom', 'ASC')->findAll();

        $deptId = (int) ($this->request->getGet('departement_id') ?? 0);
        $q = trim((string) ($this->request->getGet('q') ?? ''));

        $employeModel = new EmployeModel();
        $builder = $employeModel
            ->select('employees.*, departements.nom as departement_nom')
            ->join('departements', 'departements.id = employees.departement_id', 'left');

        if ($deptId > 0) {
            $builder->where('employees.departement_id', $deptId);
        }
        if ($q !== '') {
            $builder->groupStart()
                ->like('employees.nom', $q)
                ->orLike('employees.prenom', $q)
                ->orLike('employees.email', $q)
                ->groupEnd();
        }

        $employes = $builder->orderBy('employees.actif', 'DESC')->orderBy('employees.nom', 'ASC')->findAll();
---
SELECT *
FROM `departements`
ORDER BY `nom` ASC
SELECT `employees`.*, `departements`.`nom` as `departement_nom`
FROM `employees`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
ORDER BY `employees`.`actif` DESC, `employees`.`nom` ASC

    public function departements(): string
    {
        // TODO: implémenter la gestion des départements
        return view('admin/departements', [
            'departements' => (new DepartementModel())->orderBy('nom', 'ASC')->findAll()
        ]);
---
SELECT *
FROM `departements`
ORDER BY `nom` ASC