app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE   (
`statut` = 'approuvee'
OR `statut` = 'refusee'
 )
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
AND  `created_at` LIKE '2026-05%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `departements`
SELECT `conges`.*, `employees`.`nom`, `employees`.`prenom`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'approuvee'
AND `conges`.`date_debut` <= '2026-05-20'
AND `conges`.`date_fin` >= '2026-05-20'
ORDER BY `conges`.`date_fin` ASC
SELECT `conges`.*, `employees`.`nom`, `employees`.`prenom`, `departements`.`nom` as `departement_nom`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
ORDER BY `conges`.`created_at` DESC
 LIMIT 10
SELECT `date_debut`, `date_fin`, `statut`
FROM `conges`
WHERE `statut` = 'approuvee'
---
    public function dashboard(): string
    {
        $annee = (int) date('Y');
        $today = date('Y-m-d');

        $employeModel = new EmployeModel();
        $congeModel = new CongeModel();
        $deptModel = new DepartementModel();

        $stats = [
            'employes_actifs' => $employeModel->where('actif', 1)->countAllResults(),
            'demandes_traitees' => (new CongeModel())
                ->groupStart()
                ->where('statut', 'approuvee')
                ->orWhere('statut', 'refusee')
                ->groupEnd()
                ->countAllResults(),
            // approx: demandes approuvées ce mois
            'approuvees_mois' => (new CongeModel())
                ->where('statut', 'approuvee')
                ->like('created_at', date('Y-m'), 'after')
                ->countAllResults(),
            'departements' => $deptModel->countAllResults(),
        ];

        // Absents aujourd'hui = congés approuvés dont today est dans [date_debut, date_fin]
        $absents = $congeModel
            ->select('conges.*, employees.nom, employees.prenom, types_conge.libelle as type_libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.statut', 'approuvee')
            ->where('conges.date_debut <=', $today)
            ->where('conges.date_fin >=', $today)
            ->orderBy('conges.date_fin', 'ASC')
            ->findAll();
        $stats['absents_aujourdhui'] = is_array($absents) ? count($absents) : 0;

        $lastDemandes = (new CongeModel())
            ->select('conges.*, employees.nom, employees.prenom, departements.nom as departement_nom, types_conge.libelle as type_libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('departements', 'departements.id = employees.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->orderBy('conges.created_at', 'DESC')
            ->limit(10)
            ->findAll();

        $conges = (new CongeModel())
            ->select('date_debut, date_fin, statut')
            ->where('statut', 'approuvee')
            ->findAll();

SELECT *
FROM `departements`
ORDER BY `nom` ASC
SELECT `employees`.*, `departements`.`nom` as `departement_nom`
FROM `employees`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
ORDER BY `employees`.`actif` DESC, `employees`.`nom` ASC
---
    public function employes(): string
    {
        $deptModel = new DepartementModel();
        $departements = $deptModel->orderBy('nom', 'ASC')->findAll();

        $deptId = (int) ($this->request->getGet('departement_id') ?? 0);
        $q = trim((string) ($this->request->getGet('q') ?? ''));

        $employeModel = new EmployeModel();
        $builder = $employeModel
            ->select('employees.*, departements.nom as departement_nom')
            ->join('departements', 'departements.id = employees.departement_id', 'left');

        if ($deptId > 0) {
            $builder->where('employees.departement_id', $deptId);
        }
        if ($q !== '') {
            $builder->groupStart()
                ->like('employees.nom', $q)
                ->orLike('employees.prenom', $q)
                ->orLike('employees.email', $q)
                ->groupEnd();
        }

        $employes = $builder->orderBy('employees.actif', 'DESC')->orderBy('employees.nom', 'ASC')->findAll();

SELECT `departements`.*, COUNT(employees.id) as employe_count
FROM `departements`
LEFT JOIN `employees` ON `employees`.`departement_id` = `departements`.`id`
GROUP BY `departements`.`id`
ORDER BY `nom` ASC
---
    public function departements(): string
    {
        return view('admin/departements', [
            'departements' => (new DepartementModel())
                ->select('departements.*, COUNT(employees.id) as employe_count')
                ->join('employees', 'employees.departement_id = departements.id', 'left')
                ->groupBy('departements.id')
                ->orderBy('nom', 'ASC')
                ->findAll()
        ]);