app/Controllers/RhController.php

SELECT `conges`.*, `employees`.`nom`, `employees`.`prenom`, `employees`.`departement_id`, `departements`.`nom` as `departement_nom`, `types_conge`.`libelle` as `type_libelle`, `types_conge`.`deductible`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` DESC
---
    public function index(): string
    {
        $deptId = (int) ($this->request->getGet('departement_id') ?? 0);
        $statut = (string) ($this->request->getGet('statut') ?? 'en_attente');

        $congeModel = new CongeModel();

        $builder = $congeModel
            ->select('conges.*, employees.nom, employees.prenom, employees.departement_id, departements.nom as departement_nom, types_conge.libelle as type_libelle, types_conge.deductible')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('departements', 'departements.id = employees.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id');

        if ($statut !== '') {
            $builder->where('conges.statut', $statut);
        }
        if ($deptId > 0) {
            $builder->where('employees.departement_id', $deptId);
        }

        $demandes = $builder->orderBy('conges.created_at', 'DESC')->findAll();

SELECT *
FROM `departements`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'refusee'
---
        }

        $deptModel = new \App\Models\DepartementModel();
        $departements = $deptModel->findAll();

        $counts = [
            'en_attente' => $congeModel->where('statut', 'en_attente')->countAllResults(false),
        ];
        // reset builder due to countAllResults(false)
        $congeModel->builder()->resetQuery();
        $counts['all'] = (new CongeModel())->countAllResults();
        $counts['approuvee'] = (new CongeModel())->where('statut', 'approuvee')->countAllResults();
        $counts['refusee'] = (new CongeModel())->where('statut', 'refusee')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'refusee'
SELECT `conges`.*, `employees`.`nom`, `employees`.`prenom`, `departements`.`nom` as `departement_nom`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
ORDER BY `conges`.`created_at` DESC
 LIMIT 8
SELECT `soldes`.*, `employees`.`nom`, `employees`.`prenom`, `types_conge`.`libelle` as `type_libelle`
FROM `soldes`
JOIN `employees` ON `employees`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`annee` = 2026
ORDER BY (soldes.jours_attribues - soldes.jours_pris) DESC
 LIMIT 12
---
    public function dashboard(): string
    {
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();

        $user = session()->get('user');
        $rhId = (int) ($user['id'] ?? 0);

        $stats = [
            'en_attente' => (new CongeModel())->where('statut', 'en_attente')->countAllResults(),
            'approuvee'  => (new CongeModel())->where('statut', 'approuvee')->countAllResults(),
            'refusee'    => (new CongeModel())->where('statut', 'refusee')->countAllResults(),
        ];

        // Dernières demandes
        $lastDemandes = $congeModel
            ->select('conges.*, employees.nom, employees.prenom, departements.nom as departement_nom, types_conge.libelle as type_libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('departements', 'departements.id = employees.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->orderBy('conges.created_at', 'DESC')
            ->limit(8)
            ->findAll();

        // Soldes: top 8 soldes restants (approx) pour l'année courante
        $annee = (int) date('Y');
        $soldes = $soldeModel
            ->select('soldes.*, employees.nom, employees.prenom, types_conge.libelle as type_libelle')
            ->join('employees', 'employees.id = soldes.employe_id')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.annee', $annee)
            ->orderBy('(soldes.jours_attribues - soldes.jours_pris)', 'DESC', false)
            ->limit(12)
            ->findAll();

SELECT *
FROM `conges`
WHERE `conges`.`id` = 5
UPDATE `conges` SET `statut` = 'refusee', `commentaire_rh` = NULL, `traite_par` = 2
WHERE `conges`.`id` IN (5)
---
    public function refuse(int $id): RedirectResponse
    {
        $user = session()->get('user');
        $rhId = (int) ($user['id'] ?? 0);

        $rules = [
            'commentaire_rh' => 'permit_empty|max_length[500]',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $congeModel = new CongeModel();
        $demande = $congeModel->find($id);
        if (! $demande) {
            return redirect()->back()->with('error', 'Demande introuvable.');
        }
        if (($demande['statut'] ?? '') !== 'en_attente') {
            return redirect()->back()->with('error', 'Cette demande a déjà été traitée.');
        }

        $comment = (string) $this->request->getPost('commentaire_rh');

        $congeModel->update($id, [
            'statut' => 'refusee',
            'commentaire_rh' => $comment !== '' ? $comment : null,
            'traite_par' => $rhId ?: null,
        ]);

SELECT `conges`.*, `employees`.`nom`, `employees`.`prenom`, `employees`.`departement_id`, `departements`.`nom` as `departement_nom`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` != 'en_attente'
ORDER BY `conges`.`created_at` DESC
SELECT *
FROM `departements`
---
    public function historique(): string
    {
        $deptId = (int) ($this->request->getGet('departement_id') ?? 0);
        $statut = (string) ($this->request->getGet('statut') ?? '');

        $congeModel = new CongeModel();

        $builder = $congeModel
            ->select('conges.*, employees.nom, employees.prenom, employees.departement_id, departements.nom as departement_nom, types_conge.libelle as type_libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('departements', 'departements.id = employees.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id');

        // par défaut: historique = tout sauf en attente
        if ($statut !== '') {
            $builder->where('conges.statut', $statut);
        } else {
            $builder->where('conges.statut !=', 'en_attente');
        }

        if ($deptId > 0) {
            $builder->where('employees.departement_id', $deptId);
        }

        $demandes = $builder->orderBy('conges.created_at', 'DESC')->findAll();

        $deptModel = new \App\Models\DepartementModel();
        $departements = $deptModel->findAll();

SELECT `soldes`.*, `employees`.`nom`, `employees`.`prenom`, `employees`.`departement_id`, `departements`.`nom` as `departement_nom`, `types_conge`.`libelle` as `type_libelle`, `types_conge`.`deductible`
FROM `soldes`
JOIN `employees` ON `employees`.`id` = `soldes`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employees`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`annee` = 2026
ORDER BY `departements`.`nom` ASC, `employees`.`nom` ASC, `types_conge`.`libelle` ASC
SELECT *
FROM `departements`
---
    public function soldes(): string
    {
        $annee = (int) ($this->request->getGet('annee') ?? date('Y'));
        $deptId = (int) ($this->request->getGet('departement_id') ?? 0);

        $soldeModel = new SoldeModel();
        $builder = $soldeModel
            ->select('soldes.*, employees.nom, employees.prenom, employees.departement_id, departements.nom as departement_nom, types_conge.libelle as type_libelle, types_conge.deductible')
            ->join('employees', 'employees.id = soldes.employe_id')
            ->join('departements', 'departements.id = employees.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.annee', $annee);

        if ($deptId > 0) {
            $builder->where('employees.departement_id', $deptId);
        }

        $soldes = $builder
            ->orderBy('departements.nom', 'ASC')
            ->orderBy('employees.nom', 'ASC')
            ->orderBy('types_conge.libelle', 'ASC')
            ->findAll();

        $deptModel = new \App\Models\DepartementModel();
        $departements = $deptModel->findAll();