app/Controllers/UserCongeController.php

SELECT `soldes`.*, `types_conge`.`libelle`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 3
AND `soldes`.`annee` = 2026
---
    public function new(): string|RedirectResponse
    {
        $user = session()->get('user');
        if (! $user || empty($user['id'])) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $employeId = (int) $user['id'];
        $annee     = (int) date('Y');

        $typeModel  = new TypeCongeModel();
        $soldeModel = new SoldeModel();

        $typesConge = $typeModel->findAll();

        $soldes = $soldeModel
            ->select('soldes.*, types_conge.libelle')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.employe_id', $employeId)
            ->where('soldes.annee', $annee)
            ->findAll();

SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 3
ORDER BY `conges`.`created_at` DESC
---
    public function index(): string|RedirectResponse
    {
        $user = session()->get('user');
        if (! $user || empty($user['id'])) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $employeId = (int) $user['id'];
        $statut = (string) ($this->request->getGet('statut') ?? '');

        $congeModel = new CongeModel();
        $builder = $congeModel
            ->select('conges.*, types_conge.libelle as type_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $employeId);

        if ($statut !== '') {
            $builder->where('conges.statut', $statut);
        }

        $demandes = $builder->orderBy('conges.created_at', 'DESC')->findAll();