app/Controllers/UserDashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 3
AND `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 3
AND `statut` = 'refusee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 3
AND `statut` = 'annulee'
SELECT `soldes`.*, `types_conge`.`libelle`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 3
AND `soldes`.`annee` = 2026
ORDER BY `types_conge`.`libelle` ASC
SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 3
ORDER BY `conges`.`created_at` DESC
 LIMIT 8
---
    public function index(): string|RedirectResponse
    {
        $user = session()->get('user');
        if (! $user || empty($user['id'])) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $employeId = (int) ($user['id'] ?? 0);
        $annee = (int) date('Y');

        $stats = [
            'en_attente' => (new CongeModel())->where('employe_id', $employeId)->where('statut', 'en_attente')->countAllResults(),
            'approuvee'  => (new CongeModel())->where('employe_id', $employeId)->where('statut', 'approuvee')->countAllResults(),
            'refusee'    => (new CongeModel())->where('employe_id', $employeId)->where('statut', 'refusee')->countAllResults(),
            'annulee'    => (new CongeModel())->where('employe_id', $employeId)->where('statut', 'annulee')->countAllResults(),
        ];

        $soldes = (new SoldeModel())
            ->select('soldes.*, types_conge.libelle')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.employe_id', $employeId)
            ->where('soldes.annee', $annee)
            ->orderBy('types_conge.libelle', 'ASC')
            ->findAll();

        $lastDemandes = (new CongeModel())
            ->select('conges.*, types_conge.libelle as type_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.created_at', 'DESC')
            ->limit(8)
            ->findAll();

SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 3
ORDER BY `conges`.`date_debut` ASC
---
    public function calendar(): string|RedirectResponse
    {
        $user = session()->get('user');
        if (! $user || empty($user['id'])) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $employeId = (int) $user['id'];
        $annee = (int) date('Y');

        $conges = (new CongeModel())
            ->select('conges.*, types_conge.libelle as type_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.date_debut', 'ASC')
            ->findAll();